Testing/artillery-CreateRetrieve.yml
config:
  target: "http://localhost:8080"
  processor: "./faker-data.js"
  phases:
    - name: "Phase 1 - Create fake users"
      duration: 60
      arrivalRate: 10
    - name: "Phase 2 - Retrieve users"
      duration: 90
      arrivalRate: 50

  defaults:
    headers:
      Content-Type: "application/json"

scenarios:
  - name: "Create User"
    weight: 50
    flow:
      - function: "generateUser"
      - post:
          url: "/users"
          json: "{{ user }}"
      - think: 1

  - name: "Retrieve User by ID"
    weight: 50
    flow:
      - function: "generateUserId"
      - get:
          url: "/users/retrieve"
          qs:
            id: "{{ userId }}"
      - think: 1